-- 상위 카테고리 삽입
INSERT IGNORE INTO category (category_id, parent_id, category_name, category_level) VALUES
(1, NULL, '창작', 1),
(2, NULL, '공예', 1),
(3, NULL, '오락', 1),
(4, NULL, '아웃도어', 1),
(5, NULL, '생활', 1),
(6, NULL, '요리', 1),
(7, NULL, '패션', 1),
(8, NULL, '음악·영상 감상', 1),
(9, NULL, 'IT·디지털', 1),
(10, NULL, '반려생활', 1);

-- 하위 카테고리 삽입
INSERT IGNORE INTO category (parent_id, category_name, category_level) VALUES
-- 창작
(1, '카메라', 2),
(1, '렌즈', 2),
(1, '조명', 2),
(1, '마이크', 2),
(1, '악기', 2),
(1, '그래픽 태블릿', 2),
(1, '오디오 인터페이스', 2),

-- 공예
(2, '3D프린터', 2),
(2, '공예도구', 2),
(2, '미술도구', 2),
(2, '목공키트', 2),
(2, '수공예 재료', 2),

-- 오락
(3, '콘솔 게임기', 2),
(3, '보드게임', 2),
(3, 'VR기기', 2),
(3, '파티게임', 2),
(3, '게이밍 액세서리', 2),

-- 아웃도어
(4, '텐트', 2),
(4, '자전거', 2),
(4, '낚싯대', 2),
(4, '스키', 2),
(4, '캠핑 의자', 2),
(4, '등산화', 2),

-- 생활
(5, '커피머신', 2),
(5, '홈트기구', 2),
(5, '빔프로젝터', 2),
(5, '드론', 2),
(5, '스마트홈 기기', 2),

-- 요리
(6, '에어프라이어', 2),
(6, '오븐', 2),
(6, '블렌더', 2),
(6, '조리도구 세트', 2),
(6, '식기류', 2),

-- 패션
(7, '가방', 2),
(7, '시계', 2),
(7, '모자', 2),
(7, '신발', 2),
(7, '액세서리', 2),

-- 음악·영상 감상
(8, '헤드폰', 2),
(8, '스피커', 2),
(8, 'LP플레이어', 2),
(8, '프로젝터 스크린', 2),
(8, '스트리밍 디바이스', 2),

-- IT·디지털
(9, '노트북', 2),
(9, '태블릿', 2),
(9, '스마트폰', 2),
(9, '모니터', 2),
(9, '외장하드', 2),

-- 반려생활
(10, '반려동물 장난감', 2),
(10, '급식기', 2),
(10, '하우스', 2),
(10, '산책용품', 2);
